## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.wordpress_cpu will be created
  + resource "aws_appautoscaling_policy" "wordpress_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "wordpress_cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/wordpress/wordpress"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 20

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.wordpress_memory will be created
  + resource "aws_appautoscaling_policy" "wordpress_memory" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "wordpress_memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/wordpress/wordpress"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 40

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.wordpress will be created
  + resource "aws_appautoscaling_target" "wordpress" {
      + id                 = (known after apply)
      + max_capacity       = 5
      + min_capacity       = 2
      + resource_id        = "service/wordpress/wordpress"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:28" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:28" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/wordpress"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      + {
                          + containerPort = 9000
                          + protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 28 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>